{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 3, 100, 150], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3, 100, 150], "sparse": false, "input_dtype": "float32", "name": "input_2"}, "name": "input_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block1_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"name": "block1_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block1_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block2_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"name": "block2_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block2_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block3_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block3_conv2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"name": "block3_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block3_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block4_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block4_conv2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"name": "block4_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block4_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block5_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block5_conv2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"name": "block5_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block5_pool"}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0]]], "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "th"}, "name": "globalaveragepooling2d_1"}], "input_layers": [["input_2", 0, 0]], "name": "model_1", "output_layers": [["globalaveragepooling2d_1", 0, 0]]}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 512, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 256, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["timedistributed_1", 0, 0]]], "name": "lstm_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}, "inbound_nodes": [[["lstm_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_2"}}